app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "test deletedss"], ["updated_at", "2020-08-25 12:05:22.259286"], ["id", 17]]
---
    def update
        @article = Article.find(params[:id])
        @article.update(article_params)